**Use Google Provider < 3.46.0**

```terraform
# main.tf
terraform {
  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "< 3.46.0"
    }
  }
}

provider "google" {
  region  = "us-central1"
  project = "my-project"
}

resource "google_kms_key_ring" "my_key_ring" {
  name     = "my-key-ring"
  location = "us-central1"

  lifecycle {
    prevent_destroy = true
  }
}

resource "google_kms_crypto_key" "my_crypto_key" {
  name            = "my-crypto-key"
  key_ring        = google_kms_key_ring.my_key_ring.self_link
  rotation_period = "7776000s"

  lifecycle {
    prevent_destroy = false
  }
}
```

**Init, Plan, and Apply Changes**

```
$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/google versions matching "< 3.46.0"...
- Installing hashicorp/google v3.45.0...
- Installed hashicorp/google v3.45.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

```
$ terraform plan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_kms_crypto_key.my_crypto_key will be created
  + resource "google_kms_crypto_key" "my_crypto_key" {
      + id              = (known after apply)
      + key_ring        = (known after apply)
      + name            = "my-crypto-key"
      + purpose         = "ENCRYPT_DECRYPT"
      + rotation_period = "7776000s"
      + self_link       = (known after apply)

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # google_kms_key_ring.my_key_ring will be created
  + resource "google_kms_key_ring" "my_key_ring" {
      + id        = (known after apply)
      + location  = "us-central1"
      + name      = "my-key-ring"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_kms_crypto_key.my_crypto_key will be created
  + resource "google_kms_crypto_key" "my_crypto_key" {
      + id              = (known after apply)
      + key_ring        = (known after apply)
      + name            = "my-crypto-key"
      + purpose         = "ENCRYPT_DECRYPT"
      + rotation_period = "7776000s"
      + self_link       = (known after apply)

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # google_kms_key_ring.my_key_ring will be created
  + resource "google_kms_key_ring" "my_key_ring" {
      + id        = (known after apply)
      + location  = "us-central1"
      + name      = "my-key-ring"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_kms_key_ring.my_key_ring: Creating...
google_kms_key_ring.my_key_ring: Creation complete after 0s [id=projects/my-project/locations/us-central1/keyRings/my-key-ring]
google_kms_crypto_key.my_crypto_key: Creating...
google_kms_crypto_key.my_crypto_key: Creation complete after 0s [id=projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

**Inspect State**

```
$ terraform state show google_kms_crypto_key.my_crypto_key
# google_kms_crypto_key.my_crypto_key:
resource "google_kms_crypto_key" "my_crypto_key" {
    id              = "projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key"
    key_ring        = "projects/my-project/locations/us-central1/keyRings/my-key-ring"
    name            = "my-crypto-key"
    purpose         = "ENCRYPT_DECRYPT"
    rotation_period = "7776000s"
    self_link       = "projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key"

    version_template {
        algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
        protection_level = "SOFTWARE"
    }
}
```

**Update Google Provider = 3.46.0**

```terraform
# main.tf
terraform {
  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "= 3.46.0"
    }
  }
}

provider "google" {
  region  = "us-central1"
  project = "my-project"
}

resource "google_kms_key_ring" "my_key_ring" {
  name     = "my-key-ring"
  location = "us-central1"

  lifecycle {
    prevent_destroy = true
  }
}

resource "google_kms_crypto_key" "my_crypto_key" {
  name            = "my-crypto-key"
  key_ring        = google_kms_key_ring.my_key_ring.self_link
  rotation_period = "7776000s"

  lifecycle {
    prevent_destroy = false
  }
}
```

**Init and Plan Changes**

```
$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/google versions matching "3.46.0"...
- Installing hashicorp/google v3.46.0...
- Installed hashicorp/google v3.46.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

```
$ terraform plan
google_kms_key_ring.my_key_ring: Refreshing state... [id=projects/my-project/locations/us-central1/keyRings/my-key-ring]
google_kms_crypto_key.my_crypto_key: Refreshing state... [id=projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```

**Add Labels to Crypto Key**

```terraform
# main.tf
terraform {
  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "= 3.46.0"
    }
  }
}

provider "google" {
  region  = "us-central1"
  project = "my-project"
}

resource "google_kms_key_ring" "my_key_ring" {
  name     = "my-key-ring"
  location = "us-central1"

  lifecycle {
    prevent_destroy = true
  }
}

resource "google_kms_crypto_key" "my_crypto_key" {
  name            = "my-crypto-key"
  key_ring        = google_kms_key_ring.my_key_ring.self_link
  rotation_period = "7776000s"

  labels = {
    foo = "bar"
  }

  lifecycle {
    prevent_destroy = false
  }
}
```

**Plan Changes**

```
$ terraform plan
google_kms_key_ring.my_key_ring: Refreshing state... [id=projects/my-project/locations/us-central1/keyRings/my-key-ring]
google_kms_crypto_key.my_crypto_key: Refreshing state... [id=projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_kms_crypto_key.my_crypto_key must be replaced
-/+ resource "google_kms_crypto_key" "my_crypto_key" {
      ~ id                            = "projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key" -> (known after apply)
      ~ labels                        = {
          + "foo" = "bar"
        }
        name                          = "my-crypto-key"
      ~ self_link                     = "projects/my-project/locations/us-central1/keyRings/my-key-ring/cryptoKeys/my-crypto-key" -> (known after apply)
      + skip_initial_version_creation = false # forces replacement
        # (3 unchanged attributes hidden)

      ~ version_template {
          ~ algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION" -> (known after apply)
          ~ protection_level = "SOFTWARE" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```